Repository: Kontraktnik/kontr_back_last
Catalog: Application/Resource/Localize.Resource.*.resx
Languages: kk, ru

# Required
source: The nex field is required:
kk: Келесі өрісті толтыру қажет
ru: Следующее поле обязательно для заполнения:

# Validation Errors
source: Validation Error
kk: Валидация ошибкасы
ru: Ошибки Валидации

source: IIN
kk: ЖСН
ru: ИИН

source: Password
kk: Құпия сөз
ru: Пароль

# Unique
source: The field must be unique:
kk: Өріс бірегей болуы керек:
ru: Поле должно быть уникальным:

source: Area
kk: Облыс
ru: Область

source: Areas
kk: Облыстар
ru: Области

# TitleRu
source: Title in Russian
kk: Орыс тіліндегі атауы
ru: Наименование на русском

# TitleKz
source: Title in Kazakh
kk: Қазақша атауы
ru: Наименование на казахском

# TitleEn
source: Title in English
kk: Ағылшын тіліндегі атауы
ru: Наименование на английском

# ArmyDepartament
source: Department
kk: Департамент
ru: Департамент

# ArmyDepartaments
source: Department
kk: Департаменттер
ru: Департаменты

# ArmyRank
source: Military rank
kk: Әскери атақ
ru: Воинское звание

# ArmyRanks
source: Military ranks
kk: Әскери атақтар
ru: Воинские звания

# ArmyRegion
source: Regional command
kk: Аймақтық қолбасшылық
ru: Региональные командования

# ArmyRegions
source: Regional command
kk: Аймақтық қолбасшылықтар
ru: Региональные командования

# ArmyType
source: Type of armed forces
kk: Қарулы Күштердің түрі
ru: Тип ВС

# ArmyTypes
source: Types of armed forces
kk: Қарулы Күштердің түрлері
ru: Типы ВС

# CategoryPosition
source: Position category
kk: Лауазым санаты
ru: Категория должности

# CategoryPositions
source: Category of posts
kk: Лауазымдар санаты
ru: Категория должностей

# DriverLicense
source: Driving license
kk: Жүргізуші куәлігі
ru: Водительские права

# DriverLicenses
source: Driving license
kk: Жүргізуші куәлігі
ru: Водительские права

source: Education
kk: Білім
ru: Образование

source: Educations
kk: Білімі
ru: Образование

# JobCategory
source: Working category
kk: Жұмыс санаты
ru: Рабочая категория

# JobCategories
source: Working categories
kk: Жұмыс санаттары
ru: Рабочие категории

# JobYear
source: Length of service
kk: Еңбек сіңірген жылдары
ru: Выслуга лет

# JobYears
source: Length of service
kk: Еңбек сіңірген жылдары
ru: Выслуга лет

# JobCategoryId
source: Working category
kk: Жұмыс санаты
ru: Рабочая категория

# ServiceYearId
source: Service life
kk: Қызмет мерзімі
ru: Срок службы

source: Salary
kk: Жалақы
ru: Зарплата

source: Medical Status
kk: Медициналық мәртебе
ru: Медицинский статус

source: Medical statuses
kk: Медициналық мәртебелер
ru: Медицинские статусы

source: Code
kk: Код
ru: Код

# PhoneNotification
source: Phone Notifications
kk: Телефон арқылы хабарландырулар
ru: Уведомления по телефону

source: User ID
kk: Пайдаланушы идентификаторы
ru: Идентификатор пользователя

# Phone
source: Phone number
kk: Телефон нөмірі
ru: Номер телефона

source: Purpose
kk: Мақсат
ru: Цель

source: Position
kk: Лауазымы
ru: Должность

source: Positions
kk: Лауазымдары
ru: Должности

# SecretLevelId
source: The level of secrecy
kk: Құпиялылық деңгейі
ru: Уровень секретности

# ArmyTypeId
source: Type of armed forces
kk: Қарулы Күштердің түрі
ru: Тип ВС

# CategoryPositionId
source: Position category
kk: Лауазым санаты
ru: Категория должности

source: Profile file
kk: Профиль файлы
ru: Файл профиля

source: Profile files
kk: Профиль файлдары
ru: Файлы профиля

# Profile
source: Request
kk: Өтінім
ru: Заявка

# Profiles
source: Requests
kk: Өтінімдер
ru: Заявки

# StepGroupId
source: Group stage
kk: Топтық кезең
ru: Групповой этап

# StepId
source: Stage
kk: Кезең
ru: Этап

# SurveyId
source: Profile
kk: Сауалнама
ru: Анкета

# AreaId
source: Area
kk: Облыс
ru: Область

# RequestedUserId
source: ID of the requesting user
kk: Сұралған пайдаланушы идентификаторы
ru: Идентификатор запрашивающего пользователя

# RequestedUserIIN
source: IIN of the requesting user
kk: Сұрау салушы пайдаланушының ЖСН
ru: ИИН запрашивающего пользователя

source: Requested status
kk: Сұралған мәртебе
ru: Запрошенный статус

# RequestedSIGN
source: Requester's signature
kk: Сұрау салушының қолы
ru: Подпись запрашивающего

# ConfirmedUserId
source: ID of the confirming user
kk: Растайтын пайдаланушы идентификаторы
ru: Идентификатор подтверждающего пользователя

# ConfirmedStatus
source: Confirming status
kk: Растау мәртебесі
ru: Статус подтверждающего

# ConfirmedSIGN
source: Signature of the confirming
kk: Растаушының қолы
ru: Подпись подтверждающего

source: Status
kk: Мәртебесі
ru: Статус

# CreatedAt
source: Date of creation
kk: Құрылған күні
ru: Дата создания

# ExpiredAt
source: Expiration date
kk: Жарамдылық мерзімі
ru: Дата истечения срока действия

# UpdatedAt
source: Update date
kk: Жаңарту күні
ru: Дата обновления

source: Qualification
kk: Біліктілік
ru: Квалификация

# Percentage
source: Interest rate
kk: Пайыздық мөлшерлеме
ru: Процентная ставка

source: Rank Salary
kk: Дәрежелік жалақы
ru: Ранговое жалованье

source: Rank Salaries
kk: Дәрежелік жалақы
ru: Ранговое жалованье

# ArmyRankId
source: Military rank
kk: Әскери атақ
ru: Воинское звание

source: Relative
kk: Туыс
ru: Родственник

source: Relatives
kk: Туыстары
ru: Родственники

source: Role
kk: Рөлі
ru: Роль

source: Roles
kk: Рөлдер
ru: Роли

# SecretLevel
source: The level of secrecy
kk: Құпиялылық деңгейі
ru: Уровень секретности

# SecretLevels
source: The level of secrecy
kk: Құпиялылық деңгейі
ru: Уровень секретности

# ServiceYear
source: Year of service
kk: Қызмет жылы
ru: Год службы

# ServiceYears
source: Years of service
kk: Қызмет еткен жылдары
ru: Годы службы

# Max
source: Maximum
kk: Максималды
ru: Максимальный

# Min
source: Minimum
kk: Минималды
ru: Минимальный

# StepGroup
source: Group stage
kk: Топтық кезең
ru: Групповой этап

# StepGroups
source: Group stages
kk: Топтық кезеңдер
ru: Групповые этапы

source: Order
kk: Рет
ru: Порядок

# StepOrders
source: The order of the stages
kk: Кезеңдердің тәртібі
ru: Порядок этапов

# PreviousStepId
source: Previous stage
kk: Алдыңғы кезең
ru: Предыдущий этап

# NextStepId
source: The next stage
kk: Келесі кезең
ru: Следующий этап

# RequestedRoleId
source: The role of the requester
kk: Сұраушының рөлі
ru: Роль запрашивающего

# ConfirmedRoleId
source: The role of the confirmator
kk: Растау рөлі
ru: Роль подтверждающего

# IsFirst
source: First
kk: Бірінші
ru: Первый

# IsLast
source: Last
kk: Соңғы
ru: Последний

# DayLimit
source: Expiration date
kk: Жарамдылық мерзімі
ru: Дата истечения срока действия

# SurveyDrivers
source: Driver's licenses applications
kk: Өтініш жүргізуші куәліктері
ru: Водительские удостоверения заявки

# DriverLicenseId
source: Driving license
kk: Жүргізуші куәлігі
ru: Водительские права

# SurveyExecutors
source: Performers of the application
kk: Өтінімді орындаушылар
ru: Исполнители заявки

# ExecutorId
source: Executor
kk: Орындаушы
ru: Исполнитель

# DirectorId
source: Headmaster
kk: Басшы
ru: Руководитель

# RelativeId
source: Relative
kk: Туыс
ru: Родственник

source: Name
kk: Аты
ru: Имя

source: Surname
kk: Тегі
ru: Фамилия

source: Surname
kk: Тегі
ru: Фамилия

# Patronomic
source: Patronymic
kk: Әкесінің аты
ru: Отчество

source: Patronymic
kk: Әкесінің аты
ru: Отчество

source: Birth Date
kk: Туған күні
ru: День рождения

source: Full Name
kk: Толық аты
ru: Полное имя

source: Full Name
kk: Толық аты
ru: Полное имя

source: Email
kk: Электрондық пошта
ru: Электронная почта

# BirthAreaId
source: Place of birth
kk: Туған жері
ru: Место рождения

source: Region
kk: Аймақ
ru: Регион

source: City
kk: Қала
ru: Город

source: Street
kk: Көше
ru: Улица

source: Home
kk: Үй
ru: Дом

# Appartment
source: Flat
kk: Пәтер
ru: Квартира

# EducationId
source: Education
kk: Білім
ru: Образование

# Experienced
source: Work experience
kk: Жұмыс тәжірибесі
ru: Опыт работы

source: Served
kk: Қызмет өткерген
ru: Проходил службу

# ServedArmyNumber
source: Number of the military unit of the service
kk: Қызметтің әскери бөлімінің нөмірі
ru: Номер воинской части службы

# PositionName
source: Title of the position
kk: Лауазымның атауы
ru: Название должности

# VTShServed
source: Training at the military technical school
kk: Әскери-техникалық мектепте оқыту
ru: Обучение в военно-технической школе

# VTShId
source: Military Technical School
kk: Әскери-техникалық мектеп
ru: Военно-техническая школа

# VTShYear
source: Years of study
kk: Оқу жылдары
ru: Годы обучения

# PositionId
source: Position
kk: Лауазымы
ru: Должность

# ArmyNumber
source: Number of the military unit
kk: Әскери бөлімінің нөмірі
ru: Номер воинской части

# ContractYear
source: The validity period of the construction
kk: Келісім-шарттың қолданылу мерзімі
ru: Срок действия констракта

# VacancyId
source: Vacancy
kk: Бос орын
ru: Вакансия

# ImageUrl
source: Image
kk: Сурет
ru: Изображение

source: Autobiography
kk: Өмірбаян
ru: Автобиография

# EducationUrl
source: Education
kk: Білім
ru: Образование

# IncomePropertyUrl
source: Immovable property
kk: Жылжымайтын мүлік
ru: Недвижимая собственность

# EmploymentUrl
source: Labor book
kk: Еңбек кітабы
ru: Трудовая книга

# MillitaryUrl
source: Military ticket
kk: Әскери билет
ru: Военный билет

# SpecialCheckUrl
source: Special Check
kk: Арнайы тексеру
ru: Специальная проверка

# IdentityCardUrl
source: Identification card
kk: Жеке куәлік
ru: Удостоверение личности

# TuberUrl
source: Help from the tubdispanser
kk: Тубдиспансерден анықтама
ru: Справка с тубдиспансера

# DermatologUrl
source: Help from the skin dispensary
kk: Кожвендиспансерден анықтама
ru: Справка с кожвендиспансера

# PsychoNeurologicalUrl
source: Help from a psychiatric clinic
kk: Психиспансерден анықтама
ru: Справка с психдиспансера

# NarcologicalUrl
source: Help from the narcological dispensary
kk: Наркологиялық диспансерден анықтама
ru: Справка с наркологического диспансера

source: Agreed
kk: Келісілген
ru: Согласие

# SignKey
source: Signature key
kk: Қол қою кілті
ru: Ключ для подписи

# CurrentStepId
source: Stage
kk: Кезең
ru: Этап

# MedicalStatusId
source: Medical Status
kk: Медициналық мәртебе
ru: Медицинский статус

source: User
kk: Пайдаланушы
ru: Пользователь

source: Users
kk: Пайдаланушылар
ru: Пользователи

# RoleId
source: Role
kk: Рөлі
ru: Роль

# Verified
source: Confirmed
kk: Расталды
ru: Подтвержден

# ArmyRegionId
source: Regional command
kk: Аймақтық қолбасшылық
ru: Региональные командования

# QualificationId
source: Qualification
kk: Біліктілік
ru: Квалификация

# AuthorId
source: User
kk: Пайдаланушы
ru: Пользователь

source: Quantity
kk: Саны
ru: Количество

# DescriptionRu
source: Description in Russian
kk: Орыс тіліндегі сипаттама
ru: Описание на русском

# DescriptionEn
source: Description in English
kk: Ағылшын тіліндегі сипаттама
ru: Описание на английском

# DescriptionKz
source: Description in Kazakh
kk: Қазақша сипаттама
ru: Описание на казахском

# VtShes
source: MTS
kk: ӘТМ
ru: ВТШ

source: Not Found
kk: Табылған жоқ
ru: Не найдено

source: Created
kk: Құрылды
ru: Создано

source: Updated
kk: Жаңартылды
ru: Обновлено

source: Deleted
kk: Жойылды
ru: Удалено

source: Server Error
kk: Сервер Қатесі
ru: Ошибка Сервера

source: Bad Request
kk: Нашар сұрау
ru: Неверный Запрос

# Forbidden
source: You don't have access to this action
kk: Сіз бұл әрекетке қол жеткізе алмайсыз
ru: У вас нет доступа для данного действия

# FixedLength
source: The length of the field should be:
kk: Өрістің ұзындығы болуы керек:
ru: Длина поля должна составлять:

# MaxLength
source: The maximum field length should be:
kk: Өрістің максималды ұзындығы болуы керек:
ru: Максимальная длина поля должна составлять:

# MinLength
source: The minimum field length should be:
kk: Өрістің минималды ұзындығы болуы керек:
ru: Минимальная длина поля должна составлять:

# ExistedError
source: The following value with such a field exists:
kk: Мұндай өріспен келесі мән бар:
ru: Следующее значение с таким полем существует:

# NotExistedError
source: The following field with this value does not exist:
kk: Берілген мәні бар келесі өріс жоқ:
ru: Следующее поле с данным значением не существует:

# NotValid
source: The following field is not a valid value:
kk: Келесі өріс жарамды мән емес:
ru: Следующее поле не является валидным значением:

# SystemDataError
source: You cannot delete system data
kk: Сіз жүйелік деректерді жоя алмайсыз
ru: Вы не можете удалять системные данные

# UnexpectedError
source: Something went wrong
kk: Бірдеңе дұрыс болмады
ru: Что-то пошло не так

# Registered
source: Successfully registered
kk: Сәтті тіркелді
ru: Успешно зарегистрированы

source: Welcome
kk: Қош келдіңіз
ru: Добро пожаловать

# NotVerified
source: Your account is not verified
kk: Сіздің есептік жазбаңыз расталмаған
ru: Ваш аккаунт не подтвержден

# Nonactive
source: Your account has been deactivated
kk: Сіздің есептік жазбаңыз өшірілді
ru: Ваш аккаунт деактивирован

# Notification
source: The account verification code has been successfully sent
kk: Есептік жазбаны растау коды сәтті жіберілді
ru: Код для подтверждения аккаунта успешно отправлен

# Success
source: Completed successfully
kk: Сәтті орындалды
ru: Успешно выполнено

# Failure
source: Failed
kk: Сәтсіз аяқталды
ru: Провалено

# StatusUpdated
source: The status of your request has been updated
kk: Сіздің сұранысыңыз бойынша күй жаңартылды
ru: Статус по вашему запросу обновлен

# NotExisted
source: The following value is not created:
kk: Келесі мән жасалмады:
ru: Следующее значение не создано:

source: Saved
kk: Сақталған
ru: Сохранено

# NotEmpty
source: This field should not be empty
kk: Бұл өріс бос болмауы керек
ru: Данное поле не должно быть пустым

# NotNull
source: Fill in this field
kk: Берілген өрісті толтырыңыз
ru: Заполните данное поле

# IIN_Existed
source: This iin is already taken
kk: Бұл ЖСН тіркелген
ru: Этот иин уже зарегистрирован

# Phone_Existed
source: This phone number is already registered
kk: Бұл телефон нөмірі тіркелген
ru: Этот номер телефона уже зарегистрирован

# Email_Existed
source: This email address is already registered
kk: Бұл email тіркелген
ru: Этот email уже зарегистрирован

# Invalid_Credentials
source: Incorrect data
kk: Қате деректер
ru: Неверные данные

# Already_Verified
source: This account has already been activated
kk: Бұл есептік жазба қазірдің өзінде іске қосылды
ru: Данный аккаунт уже активирован

# Invalid_Code
source: This code has already been activated or is incorrect
kk: Бұл код қазірдің өзінде іске қосылған немесе дұрыс емес
ru: Данный код уже активирован или неверен

# Account_Verified
source: Your account has been successfully activated
kk: Сіздің есептік жазбаңыз сәтті іске қосылды
ru: Ваш аккаунт успешно активирован

# Registered_Then_Verify
source: The account has been successfully created, please confirm it by entering the code that came to the mail
kk: Есептік жазба сәтті жасалды, оны поштаға келген кодты енгізу арқылы растаңыз
ru: Учетная запись успешно создана, пожалуйста, подтвердите ее введя код пришедший на почту

# Confirm_Account
source: Please, confirm Account
kk: Есептік жазбаны растаңыз
ru: Пожалуйста, подтвердите учетную запись

# IIN_Number
source: Only digits with a length of 12 values are allowed
kk: Ұзындығы 12 мәнді сандарға ғана рұқсат етіледі
ru: Допускаются только цифры длиной в 12 значений

# Password_Rules
source: The minimum password length must exceed 6 characters, and contain letters (Latin) and numbers, as well as special characters (@_) are allowed
kk: Парольдің минималды ұзындығы 6 таңбадан асуы керек және әріптер (латын) мен сандар болуы керек, сонымен қатар арнайы таңбаларға (@_)рұқсат етіледі
ru: Минимальная длина пароля должна превышать 6 знаков, и содержать буквы (латиница) и цифры, а также разрешается специальные символы (@_)

# Name_Rules
source: Only letters of the Russian and Kazakh alphabets are allowed
kk: Тек орыс және қазақ алфавиттерінің әріптеріне рұқсат етіледі
ru: Допускаются только буквы русского и казахских алфавитов

# Phone_Rules
source: Only telephone numbers of Kazakhstani operators are allowed (+77)
kk: Қазақстандық операторлардың телефон нөмірлеріне ғана рұқсат етіледі (+77)
ru: Допускаются только телефонные номера казахстанских операторов (+77)

# Email_Rules
source: The mail is not valid
kk: Пошта жарамды емес
ru: Почта не является валидной

# OnlyNumber
source: Only numeric values are allowed
kk: Тек сандық мәндерге рұқсат етіледі
ru: Допускаются только цифренные значения
